fakox/stm32l476xx/first_example/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "stm32l476xx.h"


#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

void delay(){
	for (uint32_t i=0; i<120000;i++);
}
int main(void)
{
    GPIO_Handle_t GPIOLed_Handle;
    GPIOLed_Handle.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_5;
    GPIOLed_Handle.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_GEN_OUTPUT;
    GPIOLed_Handle.GPIO_PinConfig.GPIO_OPType=GPIO_OPTYPE_PP;
    GPIOLed_Handle.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_HIGH;
    GPIOLed_Handle.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_PIN_NOPU_NOPD;
    GPIOLed_Handle.pGPIOx=GPIOA;
    GPIO_PeriCloclControl(GPIOA, ENABLE);
    GPIO_Init(&GPIOLed_Handle);

    GPIO_Handle_t GPIOButton_Handle;
    GPIOButton_Handle.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_9;
    GPIOButton_Handle.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_INPUT;
    GPIOButton_Handle.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_HIGH;
    GPIOButton_Handle.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_PIN_NOPU_NOPD;
    GPIOButton_Handle.pGPIOx=GPIOA;
    GPIO_PeriCloclControl(GPIOA, ENABLE);
    GPIO_Init(&GPIOButton_Handle);

    while(1){
    	if(GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_9)==0){
    		GPIO_ToggleOutputPin(GPIOA,GPIO_PIN_5);
    		delay();
    	}

    }
    return 0;

}
